app/Models/Model_merk.php

  public function allData() {
    return $this->db->table('merk')
    ->get()
    ->getResultArray();
---
SELECT *
FROM `merk`

  public function detailData($id_merk) {
    return $this->db->table('merk')
    ->where('id_merk', $id_merk)
    ->get()
    ->getRowArray();
---
SELECT *
FROM `merk`
WHERE `id_merk` = '9'

  public function add($data) {
    $this->db->table('merk')->insert($data);
---
INSERT INTO `merk` (`nama_merk`) VALUES ('Compass')

  public function edit($data) {
    $this->db->table('merk')
    ->where('id_merk', $data['id_merk'])
    ->update($data);
---
UPDATE `merk` SET `id_merk` = '9', `nama_merk` = 'Ventela'
WHERE `id_merk` = '9'