app/Models/Model_sepatu.php

SELECT *
FROM `sepatu`
LEFT JOIN `merk` ON `merk`.`id_merk` = `sepatu`.`id_merk`
LEFT JOIN `tipe` ON `tipe`.`id_tipe` = `sepatu`.`id_tipe`
---
  public function allData() {
    return $this->db->table('sepatu')
    ->join('merk', 'merk.id_merk = sepatu.id_merk', 'left')
    ->join('tipe', 'tipe.id_tipe = sepatu.id_tipe', 'left')
    ->get()
    ->getResultArray();

SELECT *
FROM `sepatu`
LEFT JOIN `merk` ON `merk`.`id_merk` = `sepatu`.`id_merk`
LEFT JOIN `tipe` ON `tipe`.`id_tipe` = `sepatu`.`id_tipe`
WHERE `id_sepatu` = '1'
---
  public function detailData($id_sepatu) {
    return $this->db->table('sepatu')
    ->join('merk', 'merk.id_merk = sepatu.id_merk', 'left')
    ->join('tipe', 'tipe.id_tipe = sepatu.id_tipe', 'left')
    ->where('id_sepatu', $id_sepatu)
    ->get()
    ->getRowArray();

UPDATE `sepatu` SET `id_sepatu` = '1', `nama_sepatu` = 'Adidas Stan', `id_merk` = '1', `id_tipe` = '2', `harga_sepatu` = '10000'
WHERE `id_sepatu` = '1'
---
  public function edit($data) {
    $this->db->table('sepatu')
    ->where('id_sepatu', $data['id_sepatu'])
    ->update($data);