app/Models/Model_checkout.php

  public function allData() {
    return $this->db->table('pembelian')
    ->get()
    ->getResultArray();
---
SELECT *
FROM `pembelian`