app/Models/Model_tipe.php

  public function allData() {
    return $this->db->table('tipe')
    ->get()
    ->getResultArray();
---
SELECT *
FROM `tipe`

  public function detailData($id_tipe) {
    return $this->db->table('tipe')
    ->where('id_tipe', $id_tipe)
    ->get()
    ->getRowArray();
---
SELECT *
FROM `tipe`
WHERE `id_tipe` = '5'

  public function add($data) {
    $this->db->table('tipe')->insert($data);
---
INSERT INTO `tipe` (`nama_tipe`) VALUES ('Oxford')